Revit 2024 API
BuiltInFailures.ImportFailures.ElementRenamedOnImport Property
 There were duplicate names between the active model and the imported element. To avoid duplicate names, the imported element has been renamed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ElementRenamedOnImport { get; }
Visual Basic
Public Shared ReadOnly Property ElementRenamedOnImport As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ElementRenamedOnImport {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace